package com.cjmkeke.d2rbooks.chardatabase.character_skill_tab.assassin.martial;

public class MartialUpdate {

    public static String martialSkill1(String 레벨, String 현재명중률, String 현재공격력1, String 현재공격력2, String 현재공격력3, String 다음명중률, String 다음공격력1, String 다음공격력2, String 다음공격력3) {
        return
                "<font color='#48AE4A'>호랑이 일격</font>" +
                        "<br>충전 기술" +
                        "<br><br>연속으로 공격을 적중시키면<br>필살기의 공격력이 증가합니다.<br>용 필살기 또는 일반 공격을 사용하여<br>충전을 방출해야 합니다." +
                        "<br><br>마나 소모: 1" +
                        "<br><br>현재 기술 레벨: "+레벨+
                        "<br>명중률: +"+현재명중률+"%" +
                        "<br>충전 1 - 공격력: +"+현재공격력1+"%" +
                        "<br>충전 2 - 공격력: +"+현재공격력2+"%" +
                        "<br>충전 3 - 공격력: +"+현재공격력3+"%"+
                        "<br><br>다음 레벨"+
                        "<br>명중률: +"+다음명중률+"%" +
                        "<br>충전 1 - 공격력: +"+다음공격력1+"%" +
                        "<br>충전 2 - 공격력: +"+다음공격력2+"%" +
                        "<br>충전 3 - 공격력: +"+다음공격력3+"%";



    }

    public static String martialSkill2(String 레벨, String 현재발차기, String 현재명중률, String 현재발차기피해, String 다음발차기, String 다음명중률, String 다음발차기피해) {
        return
                "<font color='#48AE4A'>용의 발톱</font>" +
                        "<br>필살기" +
                        "<br><br>적을 걷어차서 날려버립니다.<br>발차기 기술에 충전 보너스가 추가됩니다." +
                        "<br><br>마나 소모: 6" +
                        "<br><br>현재 기술 레벨: "+레벨+
                        "<br>발차기 "+현재발차기+"회" +
                        "<br>명중률: +"+현재명중률+"%" +
                        "<br>발차기 피해: +"+현재발차기피해+"%"+
                        "<br><br>다음 레벨"+
                        "<br>발차기 "+다음발차기+"회" +
                        "<br>명중률: +"+다음명중률+"%" +
                        "<br>발차기 피해: +"+다음발차기피해+"%";
    }


    public static String martialSkill3(String 레벨, String 현재명중률, String 현재화염피해, String 현재화염피해초당, String 다음명중률, String 다음화염피해, String 다음화염피해초당) {
        return
                "<font color='#48AE4A'>화염의 주먹</font>" +
                        "<br>충전 기술" +
                        "<br><br>연속으로 공격을 적중시키면<br>필살기에 화염 피해가 추가됩니다.<br>손톱 유형의 무기로만 사용할 수 있습니다<br>용 필살기 또는 일반 공격을 사용하여 충전을 방출해야 합니다." +
                        "<br><br>마나 소모: 2" +
                        "<br><br>현재 기술 레벨: "+레벨+
                        "<br>명중률: +"+현재명중률+"%" +
                        "<br>충전 1 - 화염 피해: "+현재화염피해 +
                        "<br>충전 2 - 화염 피해 반경: 4미터" +
                        "<br>충전 3 - 평균 화염 피해: 초당 "+현재화염피해초당 +
                        "<br><br>다음 레벨"+
                        "<br>명중률: +"+다음명중률+"%" +
                        "<br>충전 1 - 화염 피해: "+다음화염피해+
                        "<br>충전 2 - 화염 피해 반경: 4미터" +
                        "<br>충전 3 - 평균 화염 피해: 초당 "+다음화염피해초당 +
                        "<br><br><font color='#48AE4A'>화염의 주먹에 보너스 적용:</font>" +
                        "<br>불사조 일격: 레벨당 화염 피해 +12%";
    }

    public static String martialSkill4(String 레벨, String 현재명중률, String 현재공격력, String 다음명중률, String 다음공격력) {
        return
                "<font color='#48AE4A'>용의 손톱</font>" +
                        "<br>필살기" +
                        "<br><br>쌍수 손톱 유형의 무기로<br>적을 난도질합니다.<br>양손의 손톱 공격에 충전 보너스를 추가합니다." +
                        "<br><br>마나 소모: 2" +
                        "<br><br>현재 기술 레벨: "+레벨+
                        "<br>명중률: +"+현재명중률+"%" +
                        "<br>공격력: +"+현재공격력+"%" +
                        "<br><br>다음 레벨"+
                        "<br>명중률: +"+다음명중률+"%" +
                        "<br>공격력: +"+다음공격력+"%" +
                        "<br><br><font color='#48AE4A'>용의 손톱에 보너스 적용:</font>" +
                        "<br>손톱 숙련: 레벨당 피해 +4%";
    }


    public static String martialSkill5(String 레벨, String 현재명중률, String 현재생명력훔치기, String 현재생명력마나훔치기1, String 현재생명력마나훔치기2, String 다음명중률, String 다음생명력훔치기, String 다음생명력마나훔치기1, String 다음생명력마나훔치기2) {
        return
                "<font color='#48AE4A'>코브라 일격</font>" +
                        "<br>충전 기술" +
                        "<br><br>연속으로 공격을 적중시키면<br>필살기에 생명력 및 마나 훔치기 효과가 추가됩니다.<br>용 필살기 또는 일반 공격을 사용하여<br>충전을 방출해야 합니다." +
                        "<br><br>마나 소모: 2" +
                        "<br><br>현재 기술 레벨: "+레벨+
                        "<br>명중률: +"+현재명중률+"%" +
                        "<br>충전 1 - 생명력 훔치기: +"+현재생명력훔치기+"%" +
                        "<br>충전 2 - 생명력 및 마나 훔치기: +"+현재생명력마나훔치기1+"%" +
                        "<br>충전 3 - 생명력 및 마나 훔치기: +"+현재생명력마나훔치기2+"%"+
                        "<br><br>다음 레벨"+
                        "<br>명중률: +"+다음명중률+"%" +
                        "<br>충전 1 - 생명력 훔치기: +"+다음생명력훔치기+"%" +
                        "<br>충전 2 - 생명력 및 마나 훔치기: +"+다음생명력마나훔치기1+"%" +
                        "<br>충전 3 - 생명력 및 마나 훔치기: +"+다음생명력마나훔치기2+"%";
    }

    public static String martialSkill6(String 레벨, String 현재명중률, String 현재번개피해, String 현재파장피해, String 현재줄기피해, String 다음명중률, String 다음번개피해, String 다음파장피해, String 다음줄기피해) {
        return
                "<font color='#48AE4A'>천둥의 손톱</font>" +
                        "<br>충전 기술" +
                        "<br><br>연속으로 공격을 적중시키면<br>필살기에 번개 피해가 추가됩니다.<br>손톱 유형의 무기로만 사용할 수 있습니다.<br>용 필살기 또는 일반 공격을 사용하여<br>충전을 방출해야 합니다." +
                        "<br><br>마나 소모: 4" +
                        "<br><br>현재 기술 레벨: "+레벨+
                        "<br>명중률: +"+현재명중률+"%" +
                        "<br>충전 1 - 번개 피해: "+현재번개피해+"" +
                        "<br>충전 2 - 번개 파장 피해: "+현재파장피해+"" +
                        "<br>충전 3 - 번개 줄기 피해: "+현재줄기피해+"" +
                        "<br><br>다음 레벨"+
                        "<br>명중률: +"+다음명중률+"%" +
                        "<br>충전 1 - 번개 피해: "+다음번개피해+"" +
                        "<br>충전 2 - 번개 파장 피해: "+다음파장피해+"" +
                        "<br>충전 3 - 번개 줄기 피해: "+다음줄기피해+"" +
                        "<br><br><font color='#48AE4A'>천둥의 손톱에 보너스 적용:</font>" +
                        "<br>불사조 일격: 레벨당 번개 피해 +8%";
    }

    public static String martialSkill7(String 레벨, String 현재명중률, String 현재화염피해, String 다음명중률, String 다음화염피해) {
        return
                "<font color='#48AE4A'>용의 꼬리</font>" +
                        "<br>필살기" +
                        "<br><br>폭발적인 힘으로 적을 걷어차 뒤로 밀쳐냅니다.<br>발차기 기술에 충전 보너스가 추가됩니다." +
                        "<br><br>반경: 4미터" +
                        "<br>마나 소모: 10" +
                        "<br><br>현재 기술 레벨: "+레벨+
                        "<br>명중률: +"+현재명중률+"%" +
                        "<br>화염 피해: +"+현재화염피해+"%"+
                        "<br><br>다음 레벨"+
                        "<br>명중률: +"+다음명중률+"%" +
                        "<br>화염 피해: +"+다음화염피해+"%";
    }

    public static String martialSkill8(String 레벨, String 현재명중률, String 현재냉기피해, String 현재냉기빙결, String 다음명중률, String 다음냉기피해, String 다음냉기빙결) {
        return
                "<font color='#48AE4A'>얼음 칼날</font>" +
                        "<br>충전 기술" +
                        "<br><br>연속으로 공격을 적중시키면<br>필살기에 냉기 피해가 추가됩니다.<br>손톱 유형의 무기로만 사용할 수 있습니다.<br>용 필살기 또는 일반 공격을 사용하여<br>충전을 방출해야 합니다." +
                        "<br><br>마나 소모: 3" +
                        "<br><br>현재 기술 레벨: "+레벨+
                        "<br>명중률: +"+현재명중률+"%" +
                        "<br>충전 1 - 냉기 피해: "+현재냉기피해+"" +
                        "<br>충전 2 - 냉기 피해 반경: 4미터" +
                        "<br>충전 3 - "+현재냉기빙결+"초 동안 빙결" +
                        "<br><br>다음 레벨"+
                        "<br>명중률: +"+다음명중률+"%" +
                        "<br>충전 1 - 냉기 피해: "+다음냉기피해+"" +
                        "<br>충전 2 - 냉기 피해 반경: 4미터" +
                        "<br>충전 3 - "+다음냉기빙결+"초 동안 빙결" +
                        "<br><br><font color='#48AE4A'>얼음 칼날에 보너스 적용:</font>" +
                        "<br>불사조 일격: 레벨당 번개 피해 +8%";
    }

    public static String martialSkill9(String 레벨, String 현재명중률, String 현재발차기피해, String 다음명중률, String 다음발차기피해) {
        return
                "<font color='#48AE4A'>용의 비상</font>" +
                        "<br>필살기" +
                        "<br><br>적에게 순간이동한 후<br>걷어차 대상을 파괴합니다." +
                        "<br>마나 소모: 15" +
                        "<br><br>현재 기술 레벨: "+레벨+
                        "<br>명중률: +"+현재명중률+"%" +
                        "<br>발차기 피해: +"+현재발차기피해+"%"+
                        "<br><br>다음 레벨"+
                        "<br>명중률: +"+다음명중률+"%" +
                        "<br>발차기 피해: +"+다음발차기피해+"%";
    }

    public static String martialSkill10(String 레벨, String 현재명중률, String 현재운석피해, String 현재화염피해초당, String 현재연쇄번개피해, String 현재혼돈얼음살피해, String 다음명중률, String 다음운석피해, String 다음화염피해초당, String 다음연쇄번개피해, String 다음혼돈얼음살피해) {
        return
                "<font color='#48AE4A'>불사조 일격</font>" +
                        "<br>충전 기술" +
                        "<br><br>필살기에 원소 공격이 추가됩니다.<br>용 필살기 또는 일반 공격을 사용하여<br>충전을 방출해야 합니다." +
                        "<br><br>마나 소모: 4" +
                        "<br><br>현재 기술 레벨: "+레벨+
                        "<br>명중률: +"+현재명중률+"%" +
                        "<br>충전 1 - 운석 피해: "+현재운석피해+"" +
                        "<br>평균 화염 피해: 초당 "+현재화염피해초당+"" +
                        "<br>충전 2 - 연쇄 번개 피해: "+현재연쇄번개피해+"" +
                        "<br>충전 3 - 혼돈 얼음살 피해: "+현재혼돈얼음살피해+"" +
                        "<br><br>다음 레벨"+
                        "<br>명중률: +"+다음명중률+"%" +
                        "<br>충전 1 - 운석 피해: "+다음운석피해+"" +
                        "<br>평균 화염 피해: 초당 "+다음화염피해초당+"" +
                        "<br>충전 2 - 연쇄 번개 피해: "+다음연쇄번개피해+"" +
                        "<br>충전 3 - 혼돈 얼음살 피해: "+다음혼돈얼음살피해+"" +
                        "<br><br><font color='#48AE4A'>불사조 일격에 보너스 적용:</font>" +
                        "<br>화염의 주먹: 레벨당 화염 피해 +10%" +
                        "<br>화염의 주먹: 레벨당 평균 초당 화염 피해 +6%" +
                        "<br>천둥의 손톱: 레벨당 번개 피해 +13%" +
                        "<br>얼음 칼날: 레벨당 냉기 피해 +10%";
    }


}
