package com.cjmkeke.d2rbooks.chardatabase.character_skill_tab.assassin.martial;

public class SkillMartial {

    public static String martialSkill1 =
            "<font color='#48AE4A'>호랑이 일격</font>" +
                    "<br>충전 기술" +
                    "<br><br>연속으로 공격을 적중시키면<br>필살기의 공격력이 증가합니다.<br>용 필살기 또는 일반 공격을 사용하여<br>충전을 방출해야 합니다." +
                    "<br><br>마나 소모: 1" +
                    "<br><br>처음 레벨" +
                    "<br>명중률: +25%" +
                    "<br>충전 1 - 공격력: +100%" +
                    "<br>충전 2 - 공격력: +200%" +
                    "<br>충전 3 - 공격력: +300%";

    public static String martialSkill2 =
            "<font color='#48AE4A'>용의 발톱</font>" +
                    "<br>필살기" +
                    "<br><br>적을 걷어차서 날려버립니다.<br>발차기 기술에 충전 보너스가 추가됩니다." +
                    "<br><br>마나 소모: 6" +
                    "<br><br>처음 레벨" +
                    "<br>발차기 1회" +
                    "<br>명중률: +20%" +
                    "<br>발차기 피해: +5%";

    public static String martialSkill3 =
            "<font color='#48AE4A'>화염의 주먹</font>" +
                    "<br>충전 기술" +
                    "<br><br>연속으로 공격을 적중시키면<br>필살기에 화염 피해가 추가됩니다.<br>손톱 유형의 무기로만 사용할 수 있습니다<br>용 필살기 또는 일반 공격을 사용하여 충전을 방출해야 합니다." +
                    "<br><br>마나 소모: 2" +
                    "<br><br>처음 레벨" +
                    "<br>명중률: +25%" +
                    "<br>충전 1 - 화염 피해: 6-10" +
                    "<br>충전 2 - 화염 피해 반경: 4미터" +
                    "<br>충전 3 - 평균 화염 피해: 초당 9-15" +
                    "<br><br><font color='#48AE4A'>화염의 주먹에 보너스 적용:</font>" +
                    "<br>불사조 일격: 레벨당 화염 피해 +12%";

    public static String martialSkill4 =
            "<font color='#48AE4A'>용의 손톱</font>" +
                    "<br>필살기" +
                    "<br><br>쌍수 손톱 유형의 무기로<br>적을 난도질합니다.<br>양손의 손톱 공격에 충전 보너스를 추가합니다." +
                    "<br>요구 레벨: 6" +
                    "<br><br>마나 소모: 2" +
                    "<br><br>처음 레벨" +
                    "<br>명중률: +40%" +
                    "<br>공격력: +50%" +
                    "<br><br><font color='#48AE4A'>용의 손톱에 보너스 적용:</font>" +
                    "<br>손톱 숙련: 레벨당 피해 +4%";

    public static String martialSkill5 =
            "<font color='#48AE4A'>코브라 일격</font>" +
                    "<br>충전 기술" +
                    "<br><br>연속으로 공격을 적중시키면<br>필살기에 생명력 및 마나 훔치기 효과가 추가됩니다.<br>용 필살기 또는 일반 공격을 사용하여<br>충전을 방출해야 합니다." +
                    "<br>요구 레벨: 12" +
                    "<br><br>마나 소모: 2" +
                    "<br><br>처음 레벨" +
                    "<br>명중률: +25%" +
                    "<br>충전 1 - 생명력 훔치기: +40%" +
                    "<br>충전 2 - 생명력 및 마나 훔치기: +40%" +
                    "<br>충전 3 - 생명력 및 마나 훔치기: +80%";

    public static String martialSkill6 =
            "<font color='#48AE4A'>천둥의 손톱</font>" +
                    "<br>충전 기술" +
                    "<br><br>연속으로 공격을 적중시키면<br>필살기에 번개 피해가 추가됩니다.<br>손톱 유형의 무기로만 사용할 수 있습니다.<br>용 필살기 또는 일반 공격을 사용하여<br>충전을 방출해야 합니다." +
                    "<br>요구 레벨: 18" +
                    "<br><br>마나 소모: 4" +
                    "<br><br>처음 레벨" +
                    "<br>명중률: +25%" +
                    "<br>충전 1 - 번개 피해: 1-80" +
                    "<br>충전 2 - 번개 파장 피해: 1-30" +
                    "<br>충전 3 - 번개 줄기 피해: 1-40" +
                    "<br><br><font color='#48AE4A'>천둥의 손톱에 보너스 적용:</font>" +
                    "<br>불사조 일격: 레벨당 번개 피해 +8%";

    public static String martialSkill7 =
            "<font color='#48AE4A'>용의 꼬리</font>" +
                    "<br>필살기" +
                    "<br><br>폭발적인 힘으로 적을 걷어차 뒤로 밀쳐냅니다.<br>발차기 기술에 충전 보너스가 추가됩니다." +
                    "<br>요구 레벨: 18" +
                    "<br><br>반경: 4미터" +
                    "<br>마나 소모: 10" +
                    "<br><br>처음 레벨" +
                    "<br>명중률: +20%" +
                    "<br>화염 피해: +50%";

    public static String martialSkill8 =
            "<font color='#48AE4A'>얼음 칼날</font>" +
                    "<br>충전 기술" +
                    "<br><br>연속으로 공격을 적중시키면<br>필살기에 냉기 피해가 추가됩니다.<br>손톱 유형의 무기로만 사용할 수 있습니다.<br>용 필살기 또는 일반 공격을 사용하여<br>충전을 방출해야 합니다." +
                    "<br>요구 레벨: 24" +
                    "<br><br>마나 소모: 3" +
                    "<br><br>처음 레벨" +
                    "<br>명중률: +25%" +
                    "<br>충전 1 - 냉기 피해: 15-35" +
                    "<br>충전 2 - 냉기 피해 반경: 4미터" +
                    "<br>충전 3 - 4초 동안 빙결" +
                    "<br><br><font color='#48AE4A'>얼음 칼날에 보너스 적용:</font>" +
                    "<br>불사조 일격: 레벨당 번개 피해 +8%";

    public static String martialSkill9 =
            "<font color='#48AE4A'>용의 비상</font>" +
                    "<br>필살기" +
                    "<br><br>적에게 순간이동한 후<br>걷어차 대상을 파괴합니다." +
                    "<br>요구 레벨: 24" +
                    "<br>마나 소모: 15" +
                    "<br><br>처음 레벨" +
                    "<br>명중률: +60%" +
                    "<br>발차기 피해: +100%";

    public static String martialSkill10 =
            "<font color='#48AE4A'>불사조 일격</font>" +
                    "<br>충전 기술" +
                    "<br><br>필살기에 원소 공격이 추가됩니다.<br>용 필살기 또는 일반 공격을 사용하여<br>충전을 방출해야 합니다." +
                    "<br>요구 레벨: 30" +
                    "<br><br>마나 소모: 4" +
                    "<br><br>처음 레벨" +
                    "<br>명중률: +25%" +
                    "<br>충전 1 - 운석 피해: 20-40" +
                    "<br>평균 화염 피해: 초당 14-23" +
                    "<br>충전 2 - 연쇄 번개 피해: 1-40" +
                    "<br>충전 3 - 혼돈 얼음살 피해: 16-32" +
                    "<br><br><font color='#48AE4A'>불사조 일격에 보너스 적용:</font>" +
                    "<br>화염의 주먹: 레벨당 화염 피해 +10%" +
                    "<br>화염의 주먹: 레벨당 평균 초당 화염 피해 +6%" +
                    "<br>천둥의 손톱: 레벨당 번개 피해 +13%" +
                    "<br>얼음 칼날: 레벨당 냉기 피해 +10%";

    public static String martialSkill1_end =
            "<font color='#48AE4A'>호랑이 일격</font>" +
                    "<br>충전 기술" +
                    "<br><br>연속으로 공격을 적중시키면<br>필살기의 공격력이 증가합니다.<br>용 필살기 또는 일반 공격을 사용하여<br>충전을 방출해야 합니다." +
                    "<br>최대 레벨 도달" +
                    "<br><br>마나 소모: 1" +
                    "<br><br>현재 기술 레벨: 20" +
                    "<br>명중률: +215%" +
                    "<br>충전 1 - 공격력: +480%" +
                    "<br>충전 2 - 공격력: +960%" +
                    "<br>충전 3 - 공격력: +1440%";

    public static String martialSkill2_end =
            "<font color='#48AE4A'>용의 발톱</font>" +
                    "<br>필살기" +
                    "<br><br>적을 걷어차서 날려버립니다.<br>발차기 기술에 충전 보너스가 추가됩니다." +
                    "<br>최대 레벨 도달" +
                    "<br><br>마나 소모: 6" +
                    "<br><br>현재 기술 레벨: 20" +
                    "<br>발차기 4회" +
                    "<br>명중률: +685%" +
                    "<br>발차기 피해: +138%";

    public static String martialSkill3_end =
            "<font color='#48AE4A'>화염의 주먹</font>" +
                    "<br>충전 기술" +
                    "<br><br>연속으로 공격을 적중시키면<br>필살기에 화염 피해가 추가됩니다.<br>손톱 유형의 무기로만 사용할 수 있습니다<br>용 필살기 또는 일반 공격을 사용하여 충전을 방출해야 합니다." +
                    "<br>최대 레벨 도달" +
                    "<br><br>마나 소모: 2" +
                    "<br><br>현재 기술 레벨: 20" +
                    "<br>명중률: +215%" +
                    "<br>충전 1 - 화염 피해: 201-221" +
                    "<br>충전 2 - 화염 피해 반경: 4미터" +
                    "<br>충전 3 - 평균 화염 피해: 초당 289-301" +
                    "<br><br><font color='#48AE4A'>화염의 주먹에 보너스 적용:</font>" +
                    "<br>불사조 일격: 레벨당 화염 피해 +12%";

    public static String martialSkill4_end =
            "<font color='#48AE4A'>용의 손톱</font>" +
                    "<br>필살기" +
                    "<br><br>쌍수 손톱 유형의 무기로<br>적을 난도질합니다.<br>양손의 손톱 공격에 충전 보너스를 추가합니다." +
                    "<br>최대 레벨 도달" +
                    "<br><br>마나 소모: 2" +
                    "<br><br>현재 기술 레벨: 20" +
                    "<br>명중률: +515%" +
                    "<br>공격력: +335%" +
                    "<br><br><font color='#48AE4A'>용의 손톱에 보너스 적용:</font>" +
                    "<br>손톱 숙련: 레벨당 피해 +4%";

    public static String martialSkill5_end =
            "<font color='#48AE4A'>코브라 일격</font>" +
                    "<br>충전 기술" +
                    "<br><br>연속으로 공격을 적중시키면<br>필살기에 생명력 및 마나 훔치기 효과가 추가됩니다.<br>용 필살기 또는 일반 공격을 사용하여<br>충전을 방출해야 합니다." +
                    "<br>최대 레벨 도달" +
                    "<br><br>마나 소모: 2" +
                    "<br><br>현재 기술 레벨: 20" +
                    "<br>명중률: +215%" +
                    "<br>충전 1 - 생명력 훔치기: +135%" +
                    "<br>충전 2 - 생명력 및 마나 훔치기: +135%" +
                    "<br>충전 3 - 생명력 및 마나 훔치기: +270%";

    public static String martialSkill6_end =
            "<font color='#48AE4A'>천둥의 손톱</font>" +
                    "<br>충전 기술" +
                    "<br><br>연속으로 공격을 적중시키면<br>필살기에 번개 피해가 추가됩니다.<br>손톱 유형의 무기로만 사용할 수 있습니다.<br>용 필살기 또는 일반 공격을 사용하여<br>충전을 방출해야 합니다." +
                    "<br>최대 레벨 도달" +
                    "<br><br>마나 소모: 4" +
                    "<br><br>현재 기술 레벨: 20" +
                    "<br>명중률: +215%" +
                    "<br>충전 1 - 번개 피해: 1-780" +
                    "<br>충전 2 - 번개 파장 피해: 1-475" +
                    "<br>충전 3 - 번개 줄기 피해: 1-740" +
                    "<br><br><font color='#48AE4A'>천둥의 손톱에 보너스 적용:</font>" +
                    "<br>불사조 일격: 레벨당 번개 피해 +8%";

    public static String martialSkill7_end =
            "<font color='#48AE4A'>용의 꼬리</font>" +
                    "<br>필살기" +
                    "<br><br>폭발적인 힘으로 적을 걷어차 뒤로 밀쳐냅니다.<br>발차기 기술에 충전 보너스가 추가됩니다." +
                    "<br>최대 레벨 도달" +
                    "<br><br>반경: 4미터" +
                    "<br>마나 소모: 10" +
                    "<br><br>현재 기술 레벨: 20" +
                    "<br>명중률: +305%" +
                    "<br>화염 피해: +430%";

    public static String martialSkill8_end =
            "<font color='#48AE4A'>얼음 칼날</font>" +
                    "<br>충전 기술" +
                    "<br><br>연속으로 공격을 적중시키면<br>필살기에 냉기 피해가 추가됩니다.<br>손톱 유형의 무기로만 사용할 수 있습니다.<br>용 필살기 또는 일반 공격을 사용하여<br>충전을 방출해야 합니다." +
                    "<br>최대 레벨 도달" +
                    "<br><br>마나 소모: 3" +
                    "<br><br>현재 기술 레벨: 20" +
                    "<br>명중률: +215%" +
                    "<br>충전 1 - 냉기 피해: 231-259" +
                    "<br>충전 2 - 냉기 피해 반경: 4미터" +
                    "<br>충전 3 - 11.6초 동안 빙결" +
                    "<br><br><font color='#48AE4A'>얼음 칼날에 보너스 적용:</font>" +
                    "<br>불사조 일격: 레벨당 번개 피해 +8%";

    public static String martialSkill9_end =
            "<font color='#48AE4A'>용의 비상</font>" +
                    "<br>필살기" +
                    "<br><br>적에게 순간이동한 후<br>걷어차 대상을 파괴합니다." +
                    "<br>최대 레벨 도달" +
                    "<br>마나 소모: 15" +
                    "<br><br>현재 기술 레벨: 20" +
                    "<br>명중률: +535%" +
                    "<br>발차기 피해: +765%";

    public static String martialSkill10_end =
            "<font color='#48AE4A'>불사조 일격</font>" +
                    "<br>충전 기술" +
                    "<br><br>필살기에 원소 공격이 추가됩니다.<br>용 필살기 또는 일반 공격을 사용하여<br>충전을 방출해야 합니다." +
                    "<br>최대 레벨 도달" +
                    "<br><br>마나 소모: 4" +
                    "<br><br>현재 기술 레벨: 20" +
                    "<br>명중률: +215%" +
                    "<br>충전 1 - 운석 피해: 393-451" +
                    "<br>평균 화염 피해: 초당 459-478" +
                    "<br>충전 2 - 연쇄 번개 피해: 1-836" +
                    "<br>충전 3 - 혼돈 얼음살 피해: 171-193" +
                    "<br><br><font color='#48AE4A'>불사조 일격에 보너스 적용:</font>" +
                    "<br>화염의 주먹: 레벨당 화염 피해 +10%" +
                    "<br>화염의 주먹: 레벨당 평균 초당 화염 피해 +6%" +
                    "<br>천둥의 손톱: 레벨당 번개 피해 +13%" +
                    "<br>얼음 칼날: 레벨당 냉기 피해 +10%";
}